using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

/*
метод отрытой адресации (линейное опробование);
Задан набор записей следующей структуры: номер автомобиля (запись), его
марка и ФИО владельца. По номеру автомобиля найти остальные сведения.
Должны быть реализованы следующие
возможности:
1)загрузка данных из файла (текстового или типизированного);
2)сохранение данных в файл (текстовый или типизированный);
3)добавление данных;
4)удаление данных;
5)поиск данных;
6)выполнение основной задачи, указанной в упражнении.
*/

namespace HashTable
{
    class HashTable
    { 
    }
}
